from src.make_mask import make_mask


def test_make_mask():
    assert make_mask('90424923579946435907', 'Открытие вклада') == ('**5907', '')
    assert make_mask('3152479541115065', '9447344650495960', 'Перевод с карты на карту') == \
           ('3152 47** **** 5065', '9447 34** **** 5960')
    assert make_mask('2256483756542539', '78808375133947439319', 'Перевод организации') == \
           ('2256 48** **** 2539', '**9319')
    assert make_mask('24763316288121894080', '96291777776753236930', 'Перевод организации') == ('**4080', '**6930')
    assert make_mask('44238164562083919420', '8532498887072395', 'Перевод организации') == \
           ('**9420', '8532 49** **** 2395')
